Repository: AmandoP/calliope-workbook1-el
Catalog: omegat/project_save.tmx
Source language: de_de
Languages: el

source: Schau dir den Programmcode an und beschreibe was passiert, wenn der Wert der Variable „Tempo“ von 1000 auf 500 geändert wird.
el: Κοίταξε τον κώδικα του προγράμματος και περίγραψε τι συμβαίνει, αν η τιμή της μεταβλητής «Tempo» αλλάξει από 1000 σε 500.

source: Schau dir die einzelnen Schritte zum Übertragen deines Programms auf den Calliope mini genau an und bringe sie in die richtige Reihenfolge.
el: Κοίταξε προσεκτικά τα μεμονωμένα βήματα για να μεταφέρεις το πρόγραμμά σου στο Calliope mini και βάλε τα στη σωστή σειρά.

source: Schleifen
el: Βρόχοι

source: Schließe die Platine an.
el: Σύνδεσε την πλακέτα.

source: Schreibe sie auf.
el: Γράψε τα.

source: Sensoren sind wie Sinne.
el: Οι αισθητήρες είναι σαν τις αισθήσεις.

source: Sensoren31
el: Αισθητήρες31

source: Sie sind in bunte Kategorien eingeordnet.
el: Είναι ταξινομημένα σε χρωματιστές κατηγορίες.

source: So können auch andere deinen Plan lesen und mitdenken.
el: Έτσι μπορούν και άλλοι να διαβάσουν το σχέδιό σου και να σκεφτούν μαζί σου.

source: So verhinderst du, dass Programme nicht funktionieren und du nicht genau sagen kannst, woran es liegt.
el: Έτσι αποτρέπεις τα προγράμματα να μην λειτουργούν και δεν μπορείς να πεις ακριβώς τι φταίει.

source: Starte mit einem neuen Projekt und schau dir die Oberfläche genau an.
el: Ξεκίνησε ένα νέο έργο και παρατήρησε προσεκτικά τη διεπαφή.

source: Starten
el: Ξεκίνησε

source: Struktogramme
el: Δομογράμματα

source: Taste A
el: Γεύση Α

source: Taste B
el: Γεύση Β

source: Tasten
el: Κουμπιά

source: Teste im Editor und beschreibe.
el: Δοκίμασε στον επεξεργαστή και περίγραψε.

source: Teste sie im Editor und notiere die Eigenschaften.
el: Δοκίμασέ τα στον Editor και σημείωσε τα χαρακτηριστικά.

source: Testen im Simulator
el: Δοκιμή στον Προσομοιωτή

source: Testen im Simulator!
el: Δοκίμασε στον προσομοιωτή!

source: Tipp: Die Version deines Calliope mini erkennst du am Aufdruck auf der Rückseite.
el: Συμβουλή: Την έκδοση του Calliope mini σου αναγνωρίζεις από την επιγραφή στο πίσω μέρος.

source: Tipp: Teile dein Programm bereits in der Planung in kleine Schritte auf.
el: Συμβουλή: Χώρισε το πρόγραμμά σου σε μικρά βήματα ήδη κατά την προγραμματισμό.

source: Tipp: Die Farben der Blöcke geben dir einen Hinweis in welcher Kategorie du sie findest.
el: Συμβουλή: Τα χρώματα των μπλοκ σου δίνουν μια υπόδειξη σε ποια κατηγορία θα τα βρεις.

source: Tipp: Die Farben der Blöcke geben dir einen Hinweis, in welcher Kategorie du sie findest.
el: Συμβουλή: Τα χρώματα των μπλοκ σου δίνουν μια υπόδειξη σε ποια κατηγορία θα τα βρεις.

source: Tipps für die mobile Nutzung
el: Συμβουλές για τη χρήση σε κινητές συσκευές

source: Touch-Pins
el: Αφής-Ακίδες

source: Um die Datei nach dem Programmieren zu übertragen, muss der Calliope mini in den Bluetooth-Modus versetzt und mit dem mobilen Gerät verbunden sein.
el: Για να μεταφέρεις το αρχείο μετά τον προγραμματισμό, πρέπει να βάλεις το Calliope mini σε λειτουργία Bluetooth και να το συνδέσεις με το κινητό σου.

source: Verarbeitung
el: Επεξεργασία

source: Verbinde deinen Calliope mini mit dem USB-Kabel mit deinem Computer.
el: Σύνδεσε το Calliope mini σου με το καλώδιο USB στον υπολογιστή σου.

source: Verbinde die Bezeichnungen mit den einzelnen Bauteilen.
el: Σύνδεσε τις ονομασίες με τα επιμέρους εξαρτήματα.

source: Verbindung mit einem mobilen Gerät
el: Σύνδεση με μια φορητή συσκευή

source: Vergiss nicht “Knopf A” und “Knopf B” zu drücken.
el: Μην ξεχάσεις να πατήσεις το "Κουμπί A" και το "Κουμπί B".

source: Vergiss nicht, Knopf A und Knopf B zu drücken.
el: Μην ξεχάσεις να πατήσεις το κουμπί A και το κουμπί B.

source: Verwende die CO2-Platine um die Luftqualität zu messen.
el: Χρησιμοποίησε την πλακέτα CO2 για να μετρήσεις την ποιότητα του αέρα.

source: Was funktioniert noch nicht so gut?
el: Τι δεν λειτουργεί ακόμα τόσο καλά;

source: Was funktioniert nocht nicht so gut?
el: Τι δεν λειτουργεί ακόμα καλά;

source: Was funktioniert schon ziemlich gut?
el: Τι λειτουργεί ήδη αρκετά καλά;

source: Was ist Programmieren?
el: Τι είναι ο προγραμματισμός;

source: Was ist Programmieren?4Der Calliope mini8Struktogramme10Programmierumgebung12Programme übertragen16Den Calliope mini steuern17
el: Τι είναι ο προγραμματισμός;4Το Calliope mini8Δομοδιαγράμματα10Περιβάλλον προγραμματισμού12Μεταφορά προγραμμάτων16Έλεγχος του Calliope mini17

source: Weitere Informationen
el: Περισσότερες πληροφορίες

source: Weitere Informationen58
el: Περισσότερες πληροφορίες58

source: Weitere Tipps zur Nutzung mit mobilen Geräten findest du unter: https://calliope.cc/programmieren/mobil
el: Περισσότερες συμβουλές για τη χρήση με κινητές συσκευές θα βρεις εδώ: https://calliope.cc/programmieren/mobil

source: Welche Funktionen haben die einzelnen Schaltflächen?
el: Ποιες είναι οι λειτουργίες των επιμέρους κουμπιών;

source: Welche Funktionen haben die einzelnen Teile?
el: Ποιες είναι οι λειτουργίες των επιμέρους μερών;

source: Welche Teile kennst du?
el: Ποια μέρη γνωρίζεις;

source: Welche Vorgänge fallen dir noch ein, bei denen sich bestimmte Handlungen wiederholen?
el: Ποιες άλλες διαδικασίες σκέφτεσαι, όπου ορισμένες ενέργειες επαναλαμβάνονται;

source: Wenn du eine Idee hast, mache einen Plan.
el: Όταν έχεις μια ιδέα, κάνε ένα σχέδιο.

source: Wenn du genau hinsiehst, kannst du verschiedene Symbole erkennen, die dir Hinweise zu Bauteilen geben.
el: Αν κοιτάξεις προσεκτικά, μπορείς να δεις διάφορα σύμβολα που σου δίνουν υποδείξεις για τα εξαρτήματα.

source: Wenn ich Geburtstag habe,
el: Όταν έχω γενέθλια,

source: Wenn ich glücklich bin,
el: Όταν είμαι ευτυχής,

source: Wenn ich krank bin,
el: Όταν είμαι άρρωστος,

source: Wichtige Blöcke:
el: Σημαντικά μπλοκ:

source: Wie kann ich Programme speichern?
el: Πώς μπορώ να αποθηκεύσω προγράμματα;

source: Wie kann ich ein Programm öffnen?
el: Πώς μπορώ να ανοίξω ένα πρόγραμμα;

source: Wie sieht deine Rakete aus oder ein Gespenst?
el: Πώς μοιάζει το δικό σου πύραυλος ή ένα φάντασμα;

source: Wie sieht deine Rakete aus?
el: Πώς μοιάζει το δικό σου πύραυλο;

source: Wiederhole diese Testschleifen immer wieder.
el: Επανάλαβε αυτούς τους βρόχους δοκιμής ξανά και ξανά.

source: Wiederholung/Schleife
el: Επανάληψη/Βρόχος

source: Woran hast du länger getüftelt?
el: Σε τι έχεις ασχοληθεί περισσότερο;

source: Wähle als Speicherort„MINI“ aus.
el: Επίλεξε ως τοποθεσία αποθήκευσης το "MINI".

source: Ziehe nun die Datei auf das Laufwerk „MINI“ - fertig!
el: Τράβηξε τώρα το αρχείο στη μονάδα "MINI" - έτοιμο!

source: a) Erstelle eine Variable und benenne sie „Tempo“.
el: α) Δημιουργήστε μια μεταβλητή και ονόμασέ την "Tempo".

source: a) Füge hinter jeder Zahl eine Pause ein.b) Verlängere die Pausen, indem du den Wert der Millisekunden (ms) erhöhst.c) Speichere dein Programm unter dem Namen „Raketenstart“.
el: a) Προσθέστε μια παύση μετά από κάθε αριθμό. b) Παράτεινε τις παύσες αυξάνοντας την τιμή των χιλιοστών του δευτερολέπτου (ms). c) Αποθήκευσε το πρόγραμμά σου με το όνομα «Εκτόξευση Πυραύλου».

source: b) Setze die Variable „Tempo“ vor deinem Countdown auf den Wert 100.c) Ersetze die Werte in den Pause Befehlen durch den Variablen Block „Tempo“.d) Setze den Wert der Variable „Tempo“ auf 500.
el: b) Ορίστε τη μεταβλητή "Tempo" στην τιμή 100 πριν από το Countdown σου. c) Αντικατάστησε τις τιμές στις εντολές Pause με το μπλοκ μεταβλητής "Tempo". d) Ορίστε την τιμή της μεταβλητής "Tempo" στο 500.

source: bleibe ich zu Hause.
el: μένω στο σπίτι.

source: geht‘s
el: πάμε

source: lade ich Freunde ein.
el: καλώ τους φίλους μου.

source: mache ich laut Musik.
el: κάνω δυνατή μουσική.

source: symbole und muster
el: σύμβολα και μοτίβα

source: Öffne dein Programm „Raketenstart“ und führe folgende Schritte aus:
el: Άνοιξε το πρόγραμμά σου "Εκτόξευση Πυραύλου" και ακολούθησε τα παρακάτω βήματα:

source: Über „Importieren“ kannst du gespeicherte Projekte öffnen.
el: Μέσα από το "Εισαγωγή" μπορείς να ανοίξεις αποθηκευμένα έργα.

source: Über das Teilen-Symbol wird eine URL und ein QR-Code für dein Programm generiert.
el: Μέσω του συμβόλου κοινοποίησης δημιουργείται μια διεύθυνση URL και ένας κωδικός QR για το πρόγραμμά σου.

source: Überlege in welcher Reihenfolge einzelne Schritte ablaufen sollen.
el: Σκέψου με ποια σειρά θα πρέπει να γίνουν τα επιμέρους βήματα.

source: Überprüfe die einzelnen Schritte jeweils im Simulator, verbessere dein Programm und teste es erneut auf dem Calliope mini.
el: Έλεγξε κάθε βήμα στο πρόγραμμα προσομοίωσης, βελτίωσε το πρόγραμμά σου και δοκίμασέ το ξανά στο Calliope mini.

source: Übersicht
el: Επισκόπηση

source: Übertragung
el: Μεταφορά

source: • Halte Tasten A+B gedrückt.
el: • Κρατά τα κουμπιά A+B πατημένα.

source: • Jetzt kannst du Programme übertragen.• Verwende den Editor MakeCode, um ein Programm zu erstellen.• Tippe auf Herunterladen, um das Programm zu übertragen.• Nach Abschluss erscheint das Programm auf dem Calliope mini!
el: • Τώρα μπορείς να μεταφέρεις προγράμματα. • Χρησιμοποίησε τον επεξεργαστή MakeCode για να δημιουργήσεις ένα πρόγραμμα. • Πάτησε Λήψη για να μεταφέρεις το πρόγραμμα. • Μετά την ολοκλήρωση, το πρόγραμμα εμφανίζεται στο Calliope mini!

source: • Über das rote Calliope mini Icon im Bereich „Editoren und Programme“öffnest du das Verbindungsfenster.• Übertrage das individuelle ID-Muster des Calliope mini auf die Matrix.• Wird der Calliope mini gefunden, verbindet er sich automatisch mit derApp und ein Smiley erscheint.
el: • Πατώντας το κόκκινο εικονίδιο Calliope mini στην περιοχή "Επεξεργαστές και Προγράμματα" ανοίγεις το παράθυρο σύνδεσης. • Μεταφέρεις το μοναδικό σχέδιο ID του Calliope mini στη μήτρα. • Όταν βρεθεί το Calliope mini, συνδέεται αυτόματα με την εφαρμογή και εμφανίζεται ένα χαμόγελο.
